---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NumberOfCircuitFullOnSwitchPanel
source: html/cffe6141-6232-dd6d-d319-650e80b83b57.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NumberOfCircuitFullOnSwitchPanel Property

You can't change the connection type to Breakers and connect to switchboard [Panel Name] because there aren't enough space. \nYou can increase the number of circuits to be greater than [Number] to connect through breakers.

## Syntax (C#)
```csharp
public static FailureDefinitionId NumberOfCircuitFullOnSwitchPanel { get; }
```